app/controllers/api/v1/atividades_controller.rb

            def index
				atividades = Atividade.order('created_at DESC');
---
SELECT "atividades".* FROM "atividades" ORDER BY created_at DESC

			def show
				atividade = Atividade.find(params[:id])
---
SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

			def create
				atividade = Atividade.new(atividade_params)
				if atividade.save
---
INSERT INTO "atividades" ("titulo", "descricao", "dt_inicial", "dt_final", "prioridade", "status", "id_proj", "id_org", "id_eq", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

			def destroy
				atividade = Atividade.find(params[:id])
				atividade.destroy
---
SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "atividades" WHERE "atividades"."id" = $1  [["id", 31]]

			def update
				atividade = Atividade.find(params[:id])
				if atividade.update(atividade_params)
---
SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "atividades" SET "titulo" = $1, "descricao" = $2, "dt_inicial" = $3, "dt_final" = $4, "prioridade" = $5, "status" = $6, "id_proj" = $7, "updated_at" = $8 WHERE "atividades"."id" = $9

			def activity_done
				atividade = Atividade.find(params[:id])

				# status true significa Em Andamento
				# status false significa Concluida
				if atividade.status == true
					atividade.status = false
					if atividade.update({status: atividade.status})
---
SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "atividades" SET "status" = $1, "updated_at" = $2 WHERE "atividades"."id" = $3  [["status", false], ["updated_at", "2024-04-18 14:16:55.038876"], ["id", 1]]