app/controllers/api/v1/equipes_controller.rb

SELECT "equipes".* FROM "equipes" ORDER BY created_at DESC
---
            def index
				equipes = Equipe.order('created_at DESC');

SELECT "equipes".* FROM "equipes" WHERE "equipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
			def show
				equipe = Equipe.find(params[:id])

INSERT INTO "equipes" ("nome", "nivel", "id_org", "id_part", "id_proj", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["nome", "Uma Organizacao"], ["nivel", 1], ["id_org", nil], ["id_part", nil], ["id_proj", nil], ["created_at", "2024-04-16 22:44:56.062218"], ["updated_at", "2024-04-16 22:44:56.062218"]]
---
			def create
				equipe = Equipe.new(equipe_params)
				if equipe.save

SELECT "equipes".* FROM "equipes" WHERE "equipes"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
DELETE FROM "equipes" WHERE "equipes"."id" = $1  [["id", 41]]
---
			def destroy
				equipe = Equipe.find(params[:id])
				equipe.destroy

SELECT "equipes".* FROM "equipes" WHERE "equipes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "equipes" SET "nome" = $1, "updated_at" = $2 WHERE "equipes"."id" = $3  [["nome", "Organizacao editada"], ["updated_at", "2024-04-16 22:45:18.752491"], ["id", 4]]
---
			def update
				equipe = Equipe.find(params[:id])
				if equipe.update(equipe_params)