app/controllers/api/v1/organizacoes_controller.rb

            def index(menu = '')
				@organizacoes = Organizacao.order('created_at DESC');

				if @organizacoes.any? && menu.present?
					puts "Lista de Organizações:"
					@organizacoes.each do |organizacao|
						puts "ID: #{organizacao.id}, Nome: #{organizacao.nome}, Descrição: #{organizacao.descricao}"
					end
				elsif @organizacoes.any?
---
SELECT "organizacaos".* FROM "organizacaos" ORDER BY created_at DESC
SELECT 1 AS one FROM "organizacaos" LIMIT $1  [["LIMIT", 1]]

			def show(id = '')
				organizacao = id.present? ? Organizacao.where(id: id).first : Organizacao.where(id: params[:id]).first

				if organizacao && id.present?
---
SELECT "organizacaos".* FROM "organizacaos" WHERE "organizacaos"."id" = $1 ORDER BY "organizacaos"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "organizacaos".* FROM "organizacaos" WHERE "organizacaos"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]

			def create(params = '')
				organizacao = params.present? ? Organizacao.new(params) : Organizacao.new(organizacao_params)

				if params.present? && organizacao.save
					puts "Organização salva com sucesso:"
					puts "ID: #{organizacao.id}, Nome: #{organizacao.nome}, Descrição: #{organizacao.descricao}"
				elsif organizacao.save
---
INSERT INTO "organizacaos" ("nome", "descricao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Org console"], ["descricao", "teste"], ["created_at", "2024-04-18 16:19:19.329829"], ["updated_at", "2024-04-18 16:19:19.329829"]]
INSERT INTO "organizacaos" ("nome", "descricao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Uma Organizacao"], ["descricao", "muito organizada."], ["created_at", "2024-04-18 19:49:31.251583"], ["updated_at", "2024-04-18 19:49:31.251583"]]

			def destroy(id = '')
				organizacao = id.present? ? Organizacao.find(id) : Organizacao.find(params[:id])

				if organizacao && id.present?
					puts "Organização deletada com sucesso:"
					puts "ID: #{organizacao.id}, Nome: #{organizacao.nome}, Descrição: #{organizacao.descricao}"
				elsif organizacao
					render json: {status: 'SUCCESS', message: 'Organizacao deletada', data: organizacao}, status: :ok
				else
					puts "Organização não encontrada."
				end

				organizacao.destroy
---
SELECT "organizacaos".* FROM "organizacaos" WHERE "organizacaos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "organizacaos" WHERE "organizacaos"."id" = $1  [["id", 4]]

			def update(menu_params = '')
				organizacao = menu_params.present? ? Organizacao.find(menu_params[:id]) : Organizacao.find(params[:id])

				if menu_params.present? && organizacao.present? && organizacao.update({nome: menu_params[:nome], descricao: menu_params[:descricao]})
					puts "Organização atualizada com sucesso:"
					puts "ID: #{organizacao.id}, Nome: #{organizacao.nome}, Descrição: #{organizacao.descricao}"
				elsif organizacao.present? && organizacao.update(organizacao_params)
---
SELECT "organizacaos".* FROM "organizacaos" WHERE "organizacaos"."id" IS NULL ORDER BY "organizacaos"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "organizacaos" SET "nome" = $1, "descricao" = $2, "updated_at" = $3 WHERE "organizacaos"."id" = $4  [["nome", "fdsgf"], ["descricao", "fgds"], ["updated_at", "2024-04-18 16:58:07.147628"], ["id", 2]]
UPDATE "organizacaos" SET "nome" = $1, "descricao" = $2, "updated_at" = $3 WHERE "organizacaos"."id" = $4  [["nome", "Organizacao editada"], ["descricao", "deu certo!"], ["updated_at", "2024-04-18 19:49:52.236874"], ["id", 3]]

			def projects_with_completion_percentage_by_organization(menu_id = '', menu = '')
				org_id = menu_id.present? ? menu_id : params[:id]
				projects_by_team = Projeto.where(id_org: org_id)
										   .joins(:equipe)
										   .select("projetos.id AS projeto_id, projetos.titulo AS projeto_titulo,
													equipes.id AS equipe_id, equipes.nome AS equipe_nome")
										   .group_by { |projeto| [projeto.equipe_id, projeto.equipe_nome] }

				result = {}

				projects_by_team.each do |(equipe_id, equipe_nome), projetos|
				  result[equipe_id] ||= { equipe_id: equipe_id, equipe_nome: equipe_nome, projetos: [] }

				  projetos.each do |projeto|
					count_false = Atividade.where(id_proj: projeto.projeto_id, status: false).count
					count_all = Atividade.where(id_proj: projeto.projeto_id).count
---
SELECT COUNT(*) FROM "atividades" WHERE "atividades"."id_proj" = $1 AND "atividades"."status" = $2  [["id_proj", 1], ["status", false]]
SELECT COUNT(*) FROM "atividades" WHERE "atividades"."id_proj" = $1  [["id_proj", 1]]

			def rel_projects_by_team_and_organization(menu = '')
				projetos_por_equipe_e_organizacao = Projeto.joins(:equipe, :organizacao)
															.select("equipes.nome AS nome_equipe, organizacaos.nome AS nome_organizacao, projetos.*")

				# Construindo um hash para armazenar os projetos agrupados por equipe e organização
				projetos_por_equipe_e_organizacao_hash = {}

				projetos_por_equipe_e_organizacao.each do |projeto|
---
SELECT equipes.nome AS nome_equipe, organizacaos.nome AS nome_organizacao, projetos.* FROM "projetos" INNER JOIN "equipes" ON "equipes"."id" = "projetos"."id_eq" INNER JOIN "organizacaos" ON "organizacaos"."id" = "projetos"."id_org"