app/controllers/api/v1/participantes_controller.rb

SELECT "participantes".* FROM "participantes" ORDER BY created_at DESC
---
            def index
				participantes = Participante.order('created_at DESC');

SELECT "participantes".* FROM "participantes" WHERE "participantes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
			def show
				participante = Participante.find(params[:id])

INSERT INTO "participantes" ("email", "cargo", "nome", "senha", "id_eq", "id_org", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
			def create
				participante = Participante.new(participante_params)
				if participante.save

SELECT "participantes".* FROM "participantes" WHERE "participantes"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]
DELETE FROM "participantes" WHERE "participantes"."id" = $1  [["id", 81]]
---
			def destroy
				participante = Participante.find(params[:id])
				participante.destroy

SELECT "participantes".* FROM "participantes" WHERE "participantes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "participantes" SET "email" = $1, "cargo" = $2, "nome" = $3, "senha" = $4, "updated_at" = $5 WHERE "participantes"."id" = $6  [["email", "participante_editado@email.com"], ["cargo", 1], ["nome", "participante editado"], ["senha", "12345"], ["updated_at", "2024-04-16 22:28:08.005091"], ["id", 4]]
---
			def update
				participante = Participante.find(params[:id])
				if participante.update(participante_params)