app/controllers/api/v1/projetos_controller.rb

SELECT "projetos".* FROM "projetos" ORDER BY created_at DESC
---
            def index
				projetos = Projeto.order('created_at DESC');

SELECT "projetos".* FROM "projetos" WHERE "projetos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
			def show
				projeto = Projeto.find(params[:id])

INSERT INTO "projetos" ("titulo", "descricao", "prazo_inicial", "prazo_final", "status", "nivel", "id_org", "id_eq", "id_ativ", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
			def create
				projeto = Projeto.new(projeto_params)
				if projeto.save

SELECT "projetos".* FROM "projetos" WHERE "projetos"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
DELETE FROM "projetos" WHERE "projetos"."id" = $1  [["id", 51]]
---
			def destroy
				projeto = Projeto.find(params[:id])
				projeto.destroy

SELECT "projetos".* FROM "projetos" WHERE "projetos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "projetos" SET "titulo" = $1, "descricao" = $2, "prazo_inicial" = $3, "prazo_final" = $4, "updated_at" = $5 WHERE "projetos"."id" = $6  [["titulo", "Projeto um."], ["descricao", "Várias atividades"], ["prazo_inicial", "2024-01-01"], ["prazo_final", "2025-01-01"], ["updated_at", "2024-04-16 23:18:08.781356"], ["id", 4]]
---
			def update
				projeto = Projeto.find(params[:id])
				if projeto.update(projeto_params)

SELECT "projetos".* FROM "projetos" WHERE "projetos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "atividades".* FROM "atividades" INNER JOIN "projetos" ON "projetos"."id" = "atividades"."id_proj" WHERE "projetos"."id" = $1  [["id", 1]]
---
			def project_done
				projeto = Projeto.find(params[:id])

				atividades_do_projeto = Atividade.joins(:projeto).where(projetos: { id: projeto.id })

				todas_as_atividades_concluidas = atividades_do_projeto.all? { |atividade| atividade.status == false }

SELECT equipes.nome AS nome_equipe, atividades.* FROM "atividades" INNER JOIN "projetos" ON "projetos"."id" = "atividades"."id_proj" INNER JOIN equipes ON projetos.id_eq = equipes.id GROUP BY equipes.id, atividades.id
---
			def rel_project_activities_by_team
				atividades_por_equipe = Atividade.joins(:projeto)
												  .joins("INNER JOIN equipes ON projetos.id_eq = equipes.id")
												  .select("equipes.nome AS nome_equipe, atividades.*")
												  .group("equipes.id, atividades.id")

				atividades_por_equipe_hash = {}

				atividades_por_equipe.each do |atividade|